Michaelszeng/nrf7002dk-raw-packet-scanner/src/main.c
	if (odid_identifier_idx != -1) {
		LOG_INF("%-4u (%-6s) | %-4d | %s |      %-4d        ",
			channel,
			wifi_band_txt(band),
			rssi,
			net_sprint_ll_addr_buf(raw->data + 10, WIFI_MAC_ADDR_LEN, mac_string_buf, sizeof(mac_string_buf)), raw->frame_length);

		k_sleep(K_SECONDS(0.01));
		log_hexdump(raw->data, sizeof(raw->data));
		printk("\n\n");
		
		// flags to hold whether or not a certain message was received
		int basic_id_flag = 0;
		int location_vector_flag = 0;
		int authentication_flag = 0;
		int self_id_flag = 0;
		int system_flag = 0;
		int operator_id_flag = 0;

		int num_msg_in_pack = raw->data[odid_identifier_idx+7];
		for (int msg_num=0; msg_num<num_msg_in_pack; msg_num++) {
			int msg_type = (raw->data[odid_identifier_idx + 8 + msg_num*25] - 2) / 16;  // either 0 (Basic ID), 1 (Location/Vector), 2 (Authentication), 3 (Self-ID), 4 (System), or 5 (Operator ID)
			
			switch(msg_type) {  // Decode the raw data into useful RID information
				case 0:  // Basic ID Message
					enum UA_TYPE ua_type = raw->data[odid_identifier_idx + 8 + msg_num*25 + 1] % 16;
					enum ID_TYPE id_type = raw->data[odid_identifier_idx + 8 + msg_num*25 + 1] / 16;  // floor division
					printf("\n\nID TYPE: %s.  ", ID_TYPE_STRING[id_type]);
					printf("UA TYPE: %s.  ", UA_TYPE_STRING[ua_type]);

					switch(id_type) {
						// Using curly bracs around each case to define each case as it's own frame to prevent redeclaration errors for id_buf
						case 0:{  // None --> null ID
							char id_buf[] = {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '\0'};
							printf("NULL UAV ID: %s.\n\n", id_buf);
							break;
						}
						case 1:  // Serial Number
						case 2:{  // CAA Registration
							// Loop through the Serial number in the raw decimal data and build a new string containing the serial number in ASCII
							char id_buf[21];  // initalize char array to hold the serial number (which is at most 20 ASCII chars)
							for (int i=0; i<20; i++) {
								int decimal_val = raw->data[odid_identifier_idx + 8 + msg_num*25 + 2+i];
								id_buf[i] = ASCII_DICTIONARY[decimal_val];
							}
							id_buf[20] = '\0';
							printf("SERIAL NUMBER/CAA REGISTRATION NUMBER: %s.\n\n", id_buf);
							break;
						}
						case 3:{  // UTM UUID (should be encoded as a 128-bit UUID (32-char hex string))
							char id_buf[33];
							for (int i=0; i<16; i++) {
								int decimal_val = raw->data[odid_identifier_idx + 8 + msg_num*25 + 2+i];
								id_buf[2*i] = HEX_DICTIONARY[decimal_val][0];  // 1st hex char in an array of 2 hex chars
								id_buf[2*i+1] = HEX_DICTIONARY[decimal_val][1];  // 2nd hex char in an array of 2 hex chars
							}
							id_buf[32] = '\0';
							printf("UTM UUID: %s.\n\n", id_buf);
							break;
						}							
						case 4:{  // Specific Session ID (1st byte is an in betwen 0 and 255, and 19 remaining bytes are alphanumeric code, according to this: https://www.rfc-editor.org/rfc/rfc9153.pdf)
							char* id_buf[21];  // initalize char array to hold the serial number (which is at most 20 ASCII chars)
							sprintf(id_buf[0], "%d", raw->data[odid_identifier_idx + 8 + msg_num*25 + 2]);
							// Loop through the Session ID in the raw decimal data and build a new string containing the serial number in ASCII
							for (int i=1; i<20; i++) {
								int decimal_val = raw->data[odid_identifier_idx + 8 + msg_num*25 + 2+i];
								id_buf[i] = ASCII_DICTIONARY[decimal_val];
							}
							// printf("SPECIFIC SESSION ID: %s.\n\n", id_buf);
							break;
						}
					}
					basic_id_flag = 1;
					break;
				case 1:  // Location/Vector Message
					enum OPERATIONAL_STATUS op_status = raw->data[odid_identifier_idx + 8 + msg_num*25 + 1] / 16;  // floor division
					// funky modulos & floor division to get the value of each bit
					enum HEIGHT_TYPE height_type_flag = (raw->data[odid_identifier_idx + 8 + msg_num*25 + 1] % 8) / 4;  // 0: Above Takeoff. 1: AGL
					enum E_W_DIRECTION_SEGMENT direction_segment_flag = (raw->data[odid_identifier_idx + 8 + msg_num*25 + 1] % 4) / 2;  // 0: <180, 1: >=180
					enum SPEED_MULTIPLIER speed_multiplier_flag = raw->data[odid_identifier_idx + 8 + msg_num*25 + 1] % 2;;  // 0: x0.25, 1: x0.75

					uint8_t track_direction = raw->data[odid_identifier_idx + 8 + msg_num*25 + 2];  // direction measured clockwise from true north. Should be between 0-179
					if (direction_segment_flag) {  // If E_W_DIRECTION_SEGMENT is true, add 180 to the track_direction, according to ASTM.
						track_direction += 180;
					}

					uint8_t speed = raw->data[odid_identifier_idx + 8 + msg_num*25 + 3];  // ground speed in m/s
					if (speed_multiplier_flag) {
						speed = 0.75*speed + 255*0.25;  // as defined in ASTM
					}
					else {
						speed *= 0.25;
					}

					uint8_t vertical_speed = raw->data[odid_identifier_idx + 8 + msg_num*25 + 4] * 0.5;  // vertical speed in m/s (positive = up, negatve = down); multiply by 0.5 as defined in ASTM

					// lat and lon Little Endian encoded
					int32_t lat_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 5];
					int32_t lat_lsb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 6] << 8;  // multiply by 2^8
					int32_t lat_msb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 7] << 16;  // multiply by 2^16
					int32_t lat_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 8] << 24;  // multiply by 2^24
					int32_t lat_int = lat_msb + lat_msb1 + lat_lsb1 + lat_lsb;
					float lat = (float) lat_int / 10000000.0;  // divide by 10^7, according to ASTM

					int32_t lon_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 9];
					int32_t lon_lsb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 10] << 8;  // multiply by 2^8
					int32_t lon_msb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 11] << 16;  // multiply by 2^16
					int32_t lon_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 12] << 24;  // multiply by 2^24
					int32_t lon_int = lon_msb + lon_msb1 + lon_lsb1 + lon_lsb;
					float lon = (float) lon_int / 10000000.0;  // divide by 10^7, according to ASTM

					// altitudes and height Little Endian encoded
					uint16_t pressure_altitude_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 13];
					uint16_t pressure_altitude_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 14] << 8;
					uint16_t pressure_altitude = (pressure_altitude_msb + pressure_altitude_lsb) * 0.5 - 1000;

					uint16_t geodetic_altitude_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 15];
					uint16_t geodetic_altitude_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 16] << 8;
					uint16_t geodetic_altitude = (geodetic_altitude_msb + geodetic_altitude_lsb) * 0.5 - 1000;

					uint16_t height_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 17];
					uint16_t height_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 18] << 8;
					uint16_t height = (height_msb + height_lsb) * 0.5 - 1000;

					enum VERTICAL_HORIZONTAL_BARO_ALT_ACCURACY vertical_accuracy = raw->data[odid_identifier_idx + 8 + msg_num*25 + 19] / 16;  // floor division
					enum VERTICAL_HORIZONTAL_BARO_ALT_ACCURACY horizontal_accuracy = raw->data[odid_identifier_idx + 8 + msg_num*25 + 19] % 16;
					
