Michaelszeng/nrf7002dk-raw-packet-scanner/src/main.c
					enum VERTICAL_HORIZONTAL_BARO_ALT_ACCURACY baro_alt_accuracy = raw->data[odid_identifier_idx + 8 + msg_num*25 + 20] / 16;  // floor division
					enum SPEED_ACCURACY speed_accuracy = raw->data[odid_identifier_idx + 8 + msg_num*25 + 20] % 16;

					// 1/10ths of seconds since the last hour relatve to UTC time
					uint16_t timestamp_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 21];
					uint16_t timestamp_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 21] << 8;
					uint16_t timestamp = timestamp_msb + timestamp_lsb;

					uint8_t timestamp_accuracy_int = (raw->data[odid_identifier_idx + 8 + msg_num*25 + 22] % 15);  // modulo 15 to get rid of bits 7-4. Between 0.1 s and 1.5 s (0 s = unknown)
					float timestamp_accuracy = timestamp_accuracy_int * 0.1;
					
					printf("OPERATIONAL STATUS: %s.  ", OPERATIONAL_STATUS_STRING[op_status]);
					printf("HEIGHT TYPE: %s.  ", HEIGHT_TYPE_STRING[height_type_flag]);
					printf("DIRECTION SEGMENT FLAG: %s.  ", E_W_DIRECTION_SEGMENT_STRING[direction_segment_flag]);
					printf("SPEED MULTIPLIER FLAG: %s.  ", SPEED_MULTIPLIER_STRING[speed_multiplier_flag]);
					printf("HEADING (deg): %d.  ", track_direction);
					printf("SPEED (m/s): %d.  ", speed);
					printf("VERTICAL SPEED (m/s): %d.  ", vertical_speed);
					printf("LAT: %d.  ", lat_int);
					printf("LON: %d.  ", lon_int);
					printf("PRESSURE ALT: %d.  ", pressure_altitude);
					printf("GEO ALT: %d.  ", geodetic_altitude);
					printf("HEIGHT: %d.  ", height);
					printf("HORIZONTAL ACCURACY: %s.  ", VERTICAL_HORIZONTAL_BARO_ALT_ACCURACY_STRING[horizontal_accuracy]);
					printf("VERTICAL ACCURACY: %s.  ", VERTICAL_HORIZONTAL_BARO_ALT_ACCURACY_STRING[vertical_accuracy]);
					printf("BARO ALT ACCURACY: %s.  ", VERTICAL_HORIZONTAL_BARO_ALT_ACCURACY_STRING[baro_alt_accuracy]);
					printf("SPEED ACCURACY: %s.  ", SPEED_ACCURACY_STRING[speed_accuracy]);
					printf("TIMESTAMP: %d.  ", timestamp);
					printf("TIMESTAMP_ACCURACY (btwn 0.1-1.5s): %f\n\n", timestamp_accuracy);

					location_vector_flag = 1;
					break;
				case 3:  // Self ID Message
					enum SELF_ID_TYPE self_id_type = raw->data[odid_identifier_idx + 8 + msg_num*25 + 1];
					// Loop through the self id description in the raw decimal data and build a new string containing the self id description in ASCII
					char self_id_description_buf[24];  // initalize char array to hold the serial number (which is at most 20 ASCII chars)
					for (int i=0; i<23; i++) {
						int decimal_val = raw->data[odid_identifier_idx + 8 + msg_num*25 + 2 + i];
						self_id_description_buf[i] = ASCII_DICTIONARY[decimal_val];
					}
					self_id_description_buf[23] = '\0';
					printf("SELF ID: %s.\n\n", self_id_description_buf);
					self_id_flag = 1;
					break;
				case 4:  // System Message
					enum OPERATOR_LOCATION_ALTITUDE_SOURCE_TYPE operator_location_type = raw->data[odid_identifier_idx + 8 + msg_num*25 + 1] % 3; // mod 3 so that we only consider bits 1 and 0
					
					// lat and lon Little Endian encoded
					int32_t operator_lat_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 2];
					int32_t operator_lat_lsb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 3] << 8;  // multiply by 2^8
					int32_t operator_lat_msb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 4] << 16;  // multiply by 2^16
					int32_t operator_lat_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 5] << 24;  // multiply by 2^24
					int32_t operator_lat_int = operator_lat_msb + operator_lat_msb1 + operator_lat_lsb1 + operator_lat_lsb;
					float operator_lat = (float) operator_lat_int / 10000000.0;

					int32_t operator_lon_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 6];
					int32_t operator_lon_lsb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 7] << 8;  // multiply by 2^8
					int32_t operator_lon_msb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 8] << 16;  // multiply by 2^16
					int32_t operator_lon_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 9] << 24;  // multiply by 2^24
					int32_t operator_lon_int = operator_lon_msb + operator_lon_msb1 + operator_lon_lsb1 + operator_lon_lsb;
					float operator_lon = (float) operator_lon_int / 10000000.0;

					// number of aircraft in the area
					uint16_t area_count_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 10];
					uint16_t area_count_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 11] << 8;  // multiply by 2^8
					uint16_t area_count = area_count_msb + area_count_lsb;

					// radius of cylindrical area with the group of aircraft
					uint16_t area_radius = raw->data[odid_identifier_idx + 8 + msg_num*25 + 12] * 10;

					// floor and ceiling Little Endian encoded
					uint16_t area_ceiling_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 13];
					uint16_t area_ceiling_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 14] << 8;
					uint16_t area_ceiling = (area_ceiling_msb + area_ceiling_lsb) * 0.5 - 1000;

					uint16_t area_floor_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 15];
					uint16_t area_floor_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 16] << 8;
					uint16_t area_floor = (area_floor_msb + area_floor_lsb) * 0.5 - 1000;

					enum UA_CATEGORY ua_category = raw->data[odid_identifier_idx + 8 + msg_num*25 + 17] / 16;  // floor division
					enum UA_CLASS ua_classification = 0;
					if (ua_category == OPEN) {
						enum UA_CLASS ua_classification = raw->data[odid_identifier_idx + 8 + msg_num*25 + 17] % 16;
					}

					// operator altitude Little Endian encoded
					uint16_t operator_altitude_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 18];
					uint16_t operator_altitude_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 19] << 8;
					uint16_t operator_altitude = (operator_altitude_msb + operator_altitude_lsb) * 0.5 - 1000;

					// current time in seconds since 00:00:00 01/01/2019
					uint32_t system_timestamp_lsb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 20];
					uint32_t system_timestamp_lsb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 21] << 8;
					uint32_t system_timestamp_msb1 = raw->data[odid_identifier_idx + 8 + msg_num*25 + 22] << 16;
					uint32_t system_timestamp_msb = raw->data[odid_identifier_idx + 8 + msg_num*25 + 23] << 24;
					uint32_t system_timestamp = system_timestamp_msb + system_timestamp_msb1 + system_timestamp_lsb1 + system_timestamp_lsb;

