Michaelszeng/nrf7002dk-raw-packet-scanner/src/main.c
					printf("OPERATOR LOCATION SOURCE TYPE: %s.  ", OPERATOR_LOCATION_ALTITUDE_SOURCE_TYPE_STRING[operator_location_type]);
					printf("OPERATOR LAT: %d.  ", operator_lat_int);
					printf("OPERATOR LON: %d.  ", operator_lon_int);
					printf("OPERATOR ALT: %d.  ", operator_altitude);
					printf("AREA COUNT: %d.  ", area_count);
					printf("AREA RADIUS: %d.  ", area_radius);
					printf("AREA CEILING: %d.  ", area_ceiling);
					printf("AREA FLOOR: %d.  ", area_floor);
					printf("UA CATEGORY: %s.  ", UA_CATEGORY_STRING[ua_category]);
					printf("UA CLASS: %s.  ", UA_CLASS_STRING[ua_classification]);
					printf("TIMESTAMP (secs from 00:00:00 01/01/2019): %d.\n\n", system_timestamp);
					
					system_flag = 1;
					break;
				case 5:  // Operator ID Message
					// Loop through the operator id in the raw decimal data and build a new string containing the operator id in ASCII
					char operator_id_buf[21];  // initalize char array to hold the serial number (which is at most 20 ASCII chars)
					for (int i=0; i<20; i++) {
						int decimal_val = raw->data[odid_identifier_idx + 8 + msg_num*25 + 2 + i];
						operator_id_buf[i] = ASCII_DICTIONARY[decimal_val];
					}
					operator_id_buf[20] = '\0';
					printf("OPERATOR ID (CAA-issued License): %s.\n\n", operator_id_buf);

					operator_id_flag = 1;
					break;
			}
			
			printk("%d\n", msg_type);
		}
	}
}

static void handle_wifi_scan_done(struct net_mgmt_event_callback *cb)
{
	const struct wifi_status *status =
		(const struct wifi_status *)cb->info;

	if (status->status) {
		LOG_ERR("Scan request failed (%d)", status->status);
	} else {
		scan_finished = 1;  // set global variable to indicate scanning is not longer in progress
		// LOG_INF("Scan request done");
	}
}

static void wifi_mgmt_event_handler(struct net_mgmt_event_callback *cb,
				     uint32_t mgmt_event, struct net_if *iface)
{
	switch (mgmt_event) {
	case NET_EVENT_WIFI_RAW_SCAN_RESULT:
		handle_wifi_raw_scan_result(cb);  // this func call is basically instantaneous
		break;
	case NET_EVENT_WIFI_SCAN_DONE:
		handle_wifi_scan_done(cb);  // this func call is basically instantaneous
		break;
	default:
		break;
	}
}

static int wifi_scan(void)
{
	scan_finished = 0;  // set global variable to indicate scanning currently in progresss
	
	struct net_if *iface = net_if_get_default();

	if (net_mgmt(NET_REQUEST_WIFI_SCAN, iface, NULL, 0)) {
		LOG_ERR("Scan request failed");

		return -ENOEXEC;
	}

	// LOG_INF("Scan requested");

	return 0;
}

int main(void)
{
	LOG_INF("==================================PROGRAM STARTING==================================");

	net_mgmt_init_event_callback(&wifi_shell_mgmt_cb,
				     wifi_mgmt_event_handler,
				     WIFI_SHELL_MGMT_EVENTS);

	net_mgmt_add_event_callback(&wifi_shell_mgmt_cb);

#ifdef CLOCK_FEATURE_HFCLK_DIVIDE_PRESENT
	/* For now hardcode to 128MHz */
	nrfx_clock_divider_set(NRF_CLOCK_DOMAIN_HFCLK,
			       NRF_CLOCK_HFCLK_DIV_1);
#endif
	LOG_INF("Starting %s with CPU frequency: %d MHz", CONFIG_BOARD, SystemCoreClock / MHZ(1));  // should be nrf7002dk_nrf5340_cpuapp with 128 MHz

	scan_finished = 1;

	while(1) {
		if (scan_finished == 1) {  // only perform a scan if not another scan is currently in progress
			wifi_scan();
		}
		k_sleep(K_SECONDS(0.01));
	}

	LOG_INF("EXITED LOOP");
	
	return 0;
}
